In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Import customer dataframe
path_customers_21024 = r'/Users/janekobtseva/19-09-2024 Instacart Basket Analysis/02 Data/Original Data/customers_21024.csv'

In [5]:
df_customers = pd.read_csv(os.path.join(path_customers_21024), index_col = False)

In [6]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [9]:
#rename columns - renamed them to have the same name style 
df_customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [11]:
df_customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [13]:
df_customers.rename(columns = {'Surnam' : 'second_name'}, inplace = True)

In [15]:
df_customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [17]:
df_customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [19]:
df_customers.head(10)

,user_id,first_name,second_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [21]:
#Dropping columns check - nothing was checked
df_customers['state'].value_counts(dropna = False)

state
Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: count, dtype: int64

In [23]:
df_customers['gender'].value_counts(dropna = False)

gender
Male      104067
Female    102142
Name: count, dtype: int64

In [25]:
df_customers['date_joined'].value_counts(dropna = False)

date_joined
9/17/2018     213
2/10/2018     212
4/1/2019      211
9/21/2019     211
12/19/2017    210
             ...
9/1/2018      141
1/22/2018     140
11/24/2017    139
7/18/2019     138
8/6/2018      128
Name: count, Length: 1187, dtype: int64

In [27]:
df_customers['fam_status'].value_counts(dropna = False)

fam_status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: count, dtype: int64

In [29]:
df_customers['age'].value_counts(dropna = False)

age
19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: count, Length: 64, dtype: int64

In [31]:
#missing values check
df_customers.isnull().sum()

user_id             0
first_name      11259
second_name         0
gender              0
state               0
age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

In [33]:
df_missing_values=df_customers[df_customers['first_name'].isnull()==True]

In [35]:
#I guess missing the first name is not a big problem. as we have user_id. I guess, we can even drop out first_name and second name
df_missing_values

,user_id,first_name,second_name,gender,state,age,date_joined,n_dependants,fam_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [37]:
#checking for duplicates - we do not have them 
df_dups = df_missing_values[df_missing_values.duplicated()]

In [39]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, second_name, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

In [41]:
#mixed data check 

for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

/var/folders/13/1jb5kb0d14783hy2x_n_wdrm0000gn/T/ipykernel_94453/2052792248.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/13/1jb5kb0d14783hy2x_n_wdrm0000gn/T/ipykernel_94453/2052792248.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/13/1jb5kb0d14783hy2x_n_wdrm0000gn/T/ipykernel_94453/2052792248.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/13/1jb5kb0d14783hy2x_n_wdrm0000gn/T/ipykernel_94453/2052792248.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/13/1jb5kb0d14783hy2x_n_wdrm0000gn/T/ipykernel_94453/2052792248.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/13/1jb5kb0d14783hy2x_n_wdrm0000gn/T/ipykernel_94453/2052792248.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/13/1jb5kb0d14783hy2x_n_wdrm0000gn/T/ipykernel_94453/2052792248.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)

first_name

/var/folders/13/1jb5kb0d14783hy2x_n_wdrm0000gn/T/ipykernel_94453/2052792248.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/13/1jb5kb0d14783hy2x_n_wdrm0000gn/T/ipykernel_94453/2052792248.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
/var/folders/13/1jb5kb0d14783hy2x_n_wdrm0000gn/T/ipykernel_94453/2052792248.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)

In [42]:
#drop fisrt and second name, as we have user_id

df_customers_clean=df_customers.drop(columns = ['first_name','second_name'])

In [45]:
#check column names and types for merging 
df_customers_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   gender        206209 non-null  object
 2   state         206209 non-null  object
 3   age           206209 non-null  int64
 4   date_joined   206209 non-null  object
 5   n_dependants  206209 non-null  int64
 6   fam_status    206209 non-null  object
 7   income        206209 non-null  int64
dtypes: int64(4), object(4)
memory usage: 12.6+ MB

In [47]:
# Import ords_prods_merge_4.8.pkl dataframe
path_ords_prods_merge = r'/Users/janekobtseva/19-09-2024 Instacart Basket Analysis/02 Data/Prepared Data/ords_prods_merge_4.8.pkl'

In [49]:
df_ords_prods_merge = pd.read_pickle(os.path.join(path_ords_prods_merge))

In [50]:
df_ords_prods_merge.rename(columns = {'order_dow' : 'order_day_of_week'}, inplace = True)

In [51]:
df_ords_prods_merge.rename(columns = {'ords_prods_merge_order_dow.loc' : 'busiest_days_flag'}, inplace = True)

In [52]:
df_ords_prods_merge.rename(columns = {'busiest_period_of_day' : 'busiest_period_of_day_flag'}, inplace = True)

In [53]:
df_ords_prods_merge_1=df_ords_prods_merge.drop(columns = ['days_SPO_median'])

In [54]:
df_ords_prods_merge_2=df_ords_prods_merge_1.drop(columns = ['_merge'])

In [55]:
#check column names and types for merging 
df_ords_prods_merge_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32406041 entries, 0 to 32406040
Data columns (total 26 columns):
 #   Column                          Dtype
---  ------                          -----
 0   Unnamed: 0                      int64
 1   product_id                      int64
 2   product_name                    object
 3   aisle_id                        int64
 4   department_id                   int64
 5   prices                          float64
 6   order_id                        int64
 7   user_id                         int64
 8   eval_set                        object
 9   order_number                    int64
 10  order_day_of_week               int64
 11  order_hour_of_day               int64
 12  days_since_prior_order          float64
 13  add_to_cart_order               int64
 14  reordered                       int64
 15  price_range_loc                 object
 16  Busiest day                     object
 17  busiest_days_flag               object
 18  busiest_period_of_day_flag      object
 19  max_order                       int64
 20  loyalty_flag                    object
 21  prices_mean                     float64
 22  Spending_flag                   object
 23  days_since_prior_order_median   float64
 24  days_SPO_median                 float64
 25  Frequency_flag                  object
dtypes: float64(5), int64(12), object(9)
memory usage: 6.3+ GB

In [63]:
#drop _merge, as we need to test merge in the next step

In [ ]:
#Merge two files
df_merged49 = df_ords_prods_merge_2.merge(df_customers_clean, on = 'user_id', indicator=True)

In [ ]:
df_merged49['_merge'].value_counts()

In [ ]:
df_merged49.shape

In [ ]:
df_merged49_2=df_merged49.drop(columns = ['_merge'])

In [ ]:
df_merged49_2.info()

In [ ]:
#Export the merged file in pickle format as ords_prods_merge_new_variable.pkl

path_prepared_data = r'/Users/janekobtseva/19-09-2024 Instacart Basket Analysis/02 Data/Prepared Data'

In [63]:
df_merged49_2.to_pickle(os.path.join(path_prepared_data, 'merge_4_9.pkl'))